---
kind: method
id: M:Autodesk.Revit.DB.Form.IsConnectingEdge(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/b9820236-41ca-e23a-3234-54a02f9637c8.htm
---
# Autodesk.Revit.DB.Form.IsConnectingEdge Method

**中文**: 对话框、窗口、窗体

Tell if an edge is a connecting edge on a side face. Connecting edges connect vertices on different profiles.

## Syntax (C#)
```csharp
public bool IsConnectingEdge(
	Reference edgeReference
)
```

## Parameters
- **edgeReference** (`Autodesk.Revit.DB.Reference`) - The reference of the edge to be checked.